# 행또는 열 삭제
- drop()

In [55]:
import pandas as pd

## 데이터프레임 생성

## 수식 함수 

df = pd.DataFrame(
    [
        range(1,21,2),
        range(2,21,2),
        range(10,101,10)
    ],
    
    columns=[f'co{i}' for i in range(1,11)]
)
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

## 행삭제

In [56]:
df.drop(0)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

### 대부분 작업을 복사본으로 된다

In [57]:
df

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
0    1    3    5    7    9   11   13   15   17    19
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [58]:
# 첫번째 , 두번째 삭제 #set 형태
df.drop([0, 2]),df.drop({0, 2})

(   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
 1    2    4    6    8   10   12   14   16   18    20,
    co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
 1    2    4    6    8   10   12   14   16   18    20)

### 다른 방법 삭제

In [59]:
# 첫번째행 삭제
df.drop(index=0)

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
1    2    4    6    8   10   12   14   16   18    20
2   10   20   30   40   50   60   70   80   90   100

In [60]:
df.drop(index=[0,1])

   co1  co2  co3  co4  co5  co6  co7  co8  co9  co10
2   10   20   30   40   50   60   70   80   90   100

## 열삭제

### 매개변수 : labels, colums

In [61]:
df.drop(columns='co2')
df.drop('co2',axis=1)

   co1  co3  co4  co5  co6  co7  co8  co9  co10
0    1    5    7    9   11   13   15   17    19
1    2    6    8   10   12   14   16   18    20
2   10   30   40   50   60   70   80   90   100

In [62]:
df.drop(['co2','co6'],axis=1)
df.drop(columns=['co2','co6'])

   co1  co3  co4  co5  co7  co8  co9  co10
0    1    5    7    9   13   15   17    19
1    2    6    8   10   14   16   18    20
2   10   30   40   50   70   80   90   100

## 원본에 반영

In [63]:
# co2 삭제후 원본 반영
df.drop(columns='co2',inplace=True)

In [64]:
df

   co1  co3  co4  co5  co6  co7  co8  co9  co10
0    1    5    7    9   11   13   15   17    19
1    2    6    8   10   12   14   16   18    20
2   10   30   40   50   60   70   80   90   100

## del 함수
- 문법 : del 데이터프레임[열]
- 원본 바로 적용

In [65]:
del df['co6']

In [66]:
df

   co1  co3  co4  co5  co7  co8  co9  co10
0    1    5    7    9   13   15   17    19
1    2    6    8   10   14   16   18    20
2   10   30   40   50   70   80   90   100